# Homebrew taps (additional repositories)
tap "domt4/autoupdate"         # Auto-update Homebrew packages
tap "hashicorp/tap"            # HashiCorp tools
tap "olets/tap"                # zsh-abbr and other tools

# CLI tools
brew "atuin"                   # Magical shell history sync
brew "awscli"                  # AWS command line interface
brew "bat"                     # Cat clone with syntax highlighting
brew "blueutil"                # Bluetooth CLI controller
brew "carapace"                # Multi-shell completion generator
brew "curl"                    # HTTP client
brew "docker"                  # Container platform CLI
brew "eza"                     # Modern ls replacement
brew "fzf"                     # Fuzzy finder
brew "git-filter-repo"         # Git history rewriting tool
brew "ripgrep"                 # Fast recursive grep
brew "shellcheck"              # Shell script linter
brew "stow"                    # Symlink farm manager
brew "yazi"                    # Terminal file manager
brew "zimfw"                   # Zsh configuration framework
brew "zoxide"                  # Smarter cd command
brew "hashicorp/tap/terraform" # Infrastructure as code

# Applications
cask "appcleaner"              # App uninstaller
cask "bettermouse"             # Mouse customization
cask "brave-browser"           # Privacy-focused browser
cask "flux-app"                # Screen color temperature adjuster
cask "font-jetbrains-mono"     # Monospace font for coding
cask "fuse-t"                  # File system in user space
cask "ghostty"                 # Fast GPU-accelerated terminal
cask "muzzle"                  # Silence notifications during screen sharing
cask "pgadmin4"                # PostgreSQL admin tool
cask "raycast"                 # Spotlight replacement
cask "rectangle"               # Window management
cask "shottr"                  # Screenshot tool
cask "spotify"                 # Music streaming
cask "veracrypt-fuse-t"        # Disk encryption
cask "visual-studio-code"      # Code editor
cask "zoom"                    # Video conferencing
